{
  "model_type": "test",
  "architectures": ["TestModel"],
  "num_parameters": 1000,
  "hidden_size": 128,
  "num_hidden_layers": 2,
  "num_attention_heads": 4,
  "max_position_embeddings": 512,
  "vocab_size": 50000,
  "tokenizer_class": "TestTokenizer"
}